# UsageType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..UsageType Property
FabricationAncillaryUsage Class See Also
---
Fabrication ancillary usage type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public FabricationAncillaryUsageType UsageType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UsageType As FabricationAncillaryUsageType
	Get
```

Visual C++
---
```text
public:
property FabricationAncillaryUsageType UsageType {
	FabricationAncillaryUsageType get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace